
## Plan Result




<pre><code>Plan: 2 to add, 1 to change, 0 to destroy.</code></pre>

* Create
  * azurerm_key_vault_secret.ccd_importer_password
  * azurerm_key_vault_secret.ccd_importer_username
* Update
  * module.key-vault.azurerm_monitor_diagnostic_setting.kv-ds


<details><summary>Change Result (Click me)</summary>

```hcl

  # azurerm_key_vault_secret.ccd_importer_password will be created
  + resource "azurerm_key_vault_secret" "ccd_importer_password" {
      + content_type   = "terraform-managed"
      + id             = (known after apply)
      + key_vault_id   = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/sptribs-aat/providers/Microsoft.KeyVault/vaults/sptribs-aat"
      + name           = "definition-importer-password"
      + tags           = {
          + "BuiltFrom"           = "https://github.com/HMCTS/sptribs-shared-infrastructure.git"
          + "application"         = "special-tribunals"
          + "businessArea"        = "CFT"
          + "changeUrl"           = ""
          + "contactSlackChannel" = "#special-tribunals-dev-channel"
          + "environment"         = "staging"
          + "managedBy"           = "Special Tribunals"
          + "source"              = "Vault ccd-aat"
        }
      + value          = (sensitive value)
      + version        = (known after apply)
      + versionless_id = (known after apply)
    }

  # azurerm_key_vault_secret.ccd_importer_username will be created
  + resource "azurerm_key_vault_secret" "ccd_importer_username" {
      + content_type   = "terraform-managed"
      + id             = (known after apply)
      + key_vault_id   = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/sptribs-aat/providers/Microsoft.KeyVault/vaults/sptribs-aat"
      + name           = "definition-importer-username"
      + tags           = {
          + "BuiltFrom"           = "https://github.com/HMCTS/sptribs-shared-infrastructure.git"
          + "application"         = "special-tribunals"
          + "businessArea"        = "CFT"
          + "changeUrl"           = ""
          + "contactSlackChannel" = "#special-tribunals-dev-channel"
          + "environment"         = "staging"
          + "managedBy"           = "Special Tribunals"
          + "source"              = "Vault ccd-aat"
        }
      + value          = (sensitive value)
      + version        = (known after apply)
      + versionless_id = (known after apply)
    }

  # module.key-vault.azurerm_monitor_diagnostic_setting.kv-ds will be updated in-place
  ~ resource "azurerm_monitor_diagnostic_setting" "kv-ds" {
        id                         = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/sptribs-aat/providers/Microsoft.KeyVault/vaults/sptribs-aat|sptribs-aat"
        log_analytics_workspace_id = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/oms-automation/providers/Microsoft.OperationalInsights/workspaces/hmcts-nonprod"
        name                       = "sptribs-aat"
        target_resource_id         = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/sptribs-aat/providers/Microsoft.KeyVault/vaults/sptribs-aat"

        log {
            category = "AuditEvent"
            enabled  = true

            retention_policy {
                days    = 14
                enabled = true
            }
        }
      - log {
          - category = "AzurePolicyEvaluationDetails" -> null
          - enabled  = false -> null

          - retention_policy {
              - days    = 0 -> null
              - enabled = false -> null
            }
        }

      - metric {
          - category = "AllMetrics" -> null
          - enabled  = false -> null

          - retention_policy {
              - days    = 0 -> null
              - enabled = false -> null
            }
        }
    }

Plan: 2 to add, 1 to change, 0 to destroy.
```

</details>




<!-- github-comment: {"Command":"plan","PRNumber":20,"Program":"tfcmt","SHA1":"","Vars":{}} -->